Pandas dataframe.where 문법
- 조건식을 입력받고, 조건식에 대한 True의 데이터를 출력
- Series나 DataFrame과 일치하는 데이터 출력

Series.where(cond,other=None,inplcae=False,axis=None)

DataFrame.where(cond,other=None,inplcae=False,axis=None)

- cond 조건문을 입력받는 부분(TF array를 입력해도 상관없음)
- other는 조건식이 만족되지 않을 경우 채울 값을 입력 받음.

---

#### 일반적으로 데이터에 접근하는 방식인 대괄호[조건식] 대신, where 메서드간의 다른 점

In [ ]:
import pandas as pd
df=pd.DataFrame({'a':[1,2,3,4,5],
                 'b':[1,1,1,1,1]})
ser = df['a']

1. Series에서 적용 시
 - 대괄호[조건식]은 조건식이 True가 되는 결과만 출력
 - where 메서드는 조건식이 False가 되면 other에 입력된 값을 출력하거나 NaN을 출력하며 기존 배열과 형상을 맞춤.

In [ ]:
# 대괄호[조건식]은 조건식이 True가 되는 결과만 출력
ser[ser==1]

0    1
Name: a, dtype: int64

In [ ]:
# where 메서드는 조건식이 False가 되면 other에 입력된 값을 출력하거나 NaN을 출력하며 기존 배열과 형상을 맞춤.
ser.where(ser==1)

0    1.0
1    NaN
2    NaN
3    NaN
4    NaN
Name: a, dtype: float64

2. DataFrame에서 적용 시
 - 조건식의 결과가 False  일 때, 대괄호[조건식]은 NaN값을 넣고 DataFrame을 출력함.
 - 조건식의 결과가 False일 때, where 메서드는 기본값으로 NaB값을 넣고 DataFrame을 출력하지만, other 변수에 값을 입력함으로써 사용자가 원하는 값이 넣어진 DataFrame을 출력할 수 있다.

In [ ]:
df[df['a']==1]

   a  b
0  1  1

In [ ]:
#조건식의 결과가 False일 때, where 메서드는 기본값으로 NaB값을 넣고 DataFrame을 출력하지만,
df.where(df['a']==1)

     a    b
0  1.0  1.0
1  NaN  NaN
2  NaN  NaN
3  NaN  NaN
4  NaN  NaN

In [ ]:
# other 변수에 값을 입력함으로써 사용자가 원하는 값이 넣어진 DataFrame을 출력할 수 있다.
df.where(df['a']==1,other='other')

       a      b
0      1      1
1  other  other
2  other  other
3  other  other
4  other  other